IlleniumDillon/MM32F5277/PinMap/MM32_QSPI_PinMap.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2023-03-15 22:43:21
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2023-03-15 23:00:41
 * @FilePath: \buildd:\ARMFPGA\MM32F5277_Keil\PinMap\MM32_QSPI_PinMap.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */

#ifndef _MM32_QSPI_PINMAP_H_
#define _MM32_QSPI_PINMAP_H_

#include <MM32_PinMapType.h>

typedef MM32_GPIO_AFPin MM32_QSPI_Pin;

extern MM32_QSPI_Pin QSPI_DA3_PA1;
extern MM32_QSPI_Pin QSPI_DA2_PA2;
extern MM32_QSPI_Pin QSPI_DA1_PA3;
extern MM32_QSPI_Pin QSPI_DA0_PA4;
extern MM32_QSPI_Pin QSPI_SCK_PA5;
extern MM32_QSPI_Pin QSPI_NSS_PA6;

extern MM32_QSPI_Pin QSPI_SCK_PB2;
extern MM32_QSPI_Pin QSPI_DA2_PB3;
extern MM32_QSPI_Pin QSPI_DA3_PB4;
extern MM32_QSPI_Pin QSPI_SCK_PB5;
extern MM32_QSPI_Pin QSPI_NSS_PB6;
extern MM32_QSPI_Pin QSPI_DA0_PB7;
extern MM32_QSPI_Pin QSPI_DA1_PB8;
extern MM32_QSPI_Pin QSPI_NSS_PB10;

extern MM32_QSPI_Pin QSPI_SCK_PC10;
extern MM32_QSPI_Pin QSPI_NSS_PC11;

extern MM32_QSPI_Pin QSPI_DA2_PD10;
extern MM32_QSPI_Pin QSPI_DA0_PD11;
extern MM32_QSPI_Pin QSPI_DA1_PD12;
extern MM32_QSPI_Pin QSPI_DA3_PD13;

extern MM32_QSPI_Pin QSPI_NSS_PE11;
extern MM32_QSPI_Pin QSPI_SCK_PE12;

extern MM32_QSPI_Pin QSPI_SCK_PF5;
extern MM32_QSPI_Pin QSPI_NSS_PF6;
extern MM32_QSPI_Pin QSPI_DA0_PF7;
extern MM32_QSPI_Pin QSPI_DA1_PF8;
extern MM32_QSPI_Pin QSPI_DA3_PF9;
extern MM32_QSPI_Pin QSPI_DA2_PF10;

extern MM32_QSPI_Pin QSPI_DA0_PG6;
extern MM32_QSPI_Pin QSPI_SCK_PG7;
extern MM32_QSPI_Pin QSPI_DA3_PG8;

#endif